GoalApp/app/models/user.rb

    def self.find_by_credential(username, password)
        user = User.find_by(username: username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "amin"], ["LIMIT", 1]]